Revit 2024 API
BuiltInFailures.FormFailures.FormElemRegenSelfIntersectionReorderProfiles Property
 This form cannot be created due to self-intersecting geometry. Clicking the Reorder Profiles button will attempt to solve this problem.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId FormElemRegenSelfIntersectionReorderProfiles { get; }
Visual Basic
Public Shared ReadOnly Property FormElemRegenSelfIntersectionReorderProfiles As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ FormElemRegenSelfIntersectionReorderProfiles {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.FormFailures Class
Autodesk.Revit.DB Namespace